# <span style="color:maroon"> **PANDAS**

*Python Software Library* :
Providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language

In [60]:
import pandas as pd                       #importing the library

1. To manually store data in a table we create a DataFrame.

2. DataFrame is a 2-dimensional data structure that can store data of different types (including characters, integers, floating point values, categorical data and more) in columns. 

>Dictionary and Dataframes are almost similar.
>
>In Dataframes the size of every array must be same.
>
>Dictionary keys in dataframes are called: Column Headers.
>
>Dictionary values in dataframes are called: Column values.

In [61]:
#creating a dataframe and storing it in variable "df"
df=pd.DataFrame ({
    "Name" : ["Meerab", "Fatimah" ,"Zawiar"],
    "Age"  : [ 19, 8, 22] ,
    "Field": ["Bioinformatics", "none" , "AI"],
    "Blood Group" : [ "A" , "AB" , "B" ],
    "Marks" : [ 95, 100, 90]
})
df

      Name  Age           Field Blood Group  Marks
0   Meerab   19  Bioinformatics           A     95
1  Fatimah    8            none          AB    100
2   Zawiar   22              AI           B     90

### Creating Series

In [62]:
#column in a dataframe is called series.

s1 = pd.Series ([6,8,5,4])
s1

0    6
1    8
2    5
3    4
dtype: int64

In [63]:
s1=pd.Series ([6,8,5,4],name="Marks",dtype="float64")        #naming the series "marks". Changing dtype of Series.
s1

0    6.0
1    8.0
2    5.0
3    4.0
Name: Marks, dtype: float64

### Selecting individual column from dataframe

In [64]:
name=df["Name"]
name

0     Meerab
1    Fatimah
2     Zawiar
Name: Name, dtype: object

In [65]:
type(s1)             #to find data type

pandas.core.series.Series

In [66]:
type(df)

pandas.core.frame.DataFrame

In [67]:
type(df["Name"])

pandas.core.series.Series

In [68]:
type(df["Age"])

pandas.core.series.Series

In [69]:
#column = variable = series

### Statistics on dataframes

In [70]:
df            #displaying df

      Name  Age           Field Blood Group  Marks
0   Meerab   19  Bioinformatics           A     95
1  Fatimah    8            none          AB    100
2   Zawiar   22              AI           B     90

In [71]:
df.Age.max()                      #finding max value of a column of a dataframe

22

In [72]:
df["Marks"].max()

100

In [73]:
df.max()    #finding max value of each int column of a database

Name           Zawiar
Age                22
Field            none
Blood Group         B
Marks             100
dtype: object

In [74]:
df.Marks.min()

90

In [75]:
df.Field.count ()         #total values in column

3

In [76]:
df.Marks.std()

5.0

In [77]:
#Finding stat of all the int variables 

df.Age.describe()      #of a specific variable

count     3.000000
mean     16.333333
std       7.371115
min       8.000000
25%      13.500000
50%      19.000000
75%      20.500000
max      22.000000
Name: Age, dtype: float64

In [78]:
df.describe()         #of all int variables

             Age  Marks
count   3.000000    3.0
mean   16.333333   95.0
std     7.371115    5.0
min     8.000000   90.0
25%    13.500000   92.5
50%    19.000000   95.0
75%    20.500000   97.5
max    22.000000  100.0

In [79]:
stats=df.describe()        #storing in a variable 
stats

             Age  Marks
count   3.000000    3.0
mean   16.333333   95.0
std     7.371115    5.0
min     8.000000   90.0
25%    13.500000   92.5
50%    19.000000   95.0
75%    20.500000   97.5
max    22.000000  100.0

In [80]:
df.info()             #gives information of complete dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         3 non-null      object
 1   Age          3 non-null      int64
 2   Field        3 non-null      object
 3   Blood Group  3 non-null      object
 4   Marks        3 non-null      int64
dtypes: int64(2), object(3)
memory usage: 252.0+ bytes

### Dealing with empty values while creating a dataframe
>we import numpy and use Nan function : np.NaN

In [81]:
import numpy as np
df=pd.DataFrame ({   "Name" : ["Meerab", "Fatimah" ,"Zawiar","Hassan"],
    "Age"  : [ 19, 8, 22, np.NaN ] })
df

      Name   Age
0   Meerab  19.0
1  Fatimah   8.0
2   Zawiar  22.0
3   Hassan   NaN

### Saving dataset to my computer after creating it on pandas

In [82]:
df.to_csv("firstdataset.csv" , index=False )    # save without index

## Importing Dataset from Laptop

In [85]:
df3= pd.read_csv("firstdataset.csv")
df3

      Name   Age
0   Meerab  19.0
1  Fatimah   8.0
2   Zawiar  22.0
3   Hassan   NaN

# Exploring Dataset

In [1]:
#in Python2